In [17]:
#7.1 处理缺失值
import pandas as pd
import numpy as np
string_data=pd.Series(['aardvard','artichoke','np.nan','avocado'])
string_data

0     aardvard
1    artichoke
2       np.nan
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2    False
3    False
dtype: bool

In [5]:
string_data[0]=None
string_data.isnull()

0     True
1    False
2    False
3    False
dtype: bool

In [6]:
from numpy import nan as NA

In [7]:
data=pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data=pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [10]:
cleaned=data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[4]=NA

In [13]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [14]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA

In [19]:
df

          0         1         2
0  0.342677       NaN       NaN
1 -1.608575       NaN       NaN
2  1.015179       NaN -1.498811
3  0.409097       NaN -0.082653
4  0.254577  1.121400 -1.720001
5 -0.053722 -2.122592  0.004646
6  0.709501  0.748830 -0.523011

In [20]:
df.dropna()

          0         1         2
4  0.254577  1.121400 -1.720001
5 -0.053722 -2.122592  0.004646
6  0.709501  0.748830 -0.523011

In [21]:
df.dropna(thresh=2)

          0         1         2
2  1.015179       NaN -1.498811
3  0.409097       NaN -0.082653
4  0.254577  1.121400 -1.720001
5 -0.053722 -2.122592  0.004646
6  0.709501  0.748830 -0.523011